; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v3)
             (pred_12 ?v11 ?v4)
             (pred_3 ?v13 ?v4)
             (pred_10 ?v12 ?v13 )
	     (pred_5 ?v13)
             (pred_4 ?v10)
             (pred_9 ?v11)
             (pred_1 ?v4)
             (pred_7 ?v13)
             (pred_2 ?v11)
             (pred_8 ?v13)
             (pred_11 ))



(:action op_3
:parameters (?v5 ?v1 ?v2 ?v9)
:precondition (and (pred_4 ?v5) (pred_4 ?v1) (pred_9 ?v2) (pred_1 ?v9)
          (pred_6 ?v5 ?v1) (pred_12 ?v2 ?v9)
                   (pred_3 ?v1 ?v9) (pred_5 ?v5) 
                   (pred_7 ?v1) (pred_2 ?v2))
:effect (and  (pred_8 ?v1) (not (pred_7 ?v1))))


(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_4 ?v5) (pred_4 ?v6)
               (pred_5 ?v5) (pred_6 ?v5 ?v6) (pred_8 ?v6))
:effect (and (pred_5 ?v6) (not (pred_5 ?v5))))

(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_4 ?v5) (pred_9 ?v2) 
                  (pred_5 ?v5) (pred_10 ?v2 ?v5) (pred_11 ))
:effect (and (pred_2 ?v2)
   (not (pred_10 ?v2 ?v5)) (not (pred_11 ))))


(:action op_4
:parameters (?v5 ?v8 ?v7)
:precondition (and (pred_4 ?v5) (pred_9 ?v8) (pred_9 ?v7)
                  (pred_5 ?v5) (pred_2 ?v7) (pred_10 ?v8 ?v5))
:effect (and (pred_2 ?v8) (pred_10 ?v7 ?v5)
        (not (pred_2 ?v7)) (not (pred_10 ?v8 ?v5))))

(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_4 ?v5) (pred_9 ?v2) 
                  (pred_5 ?v5) (pred_2 ?v2))
:effect (and (pred_11 ) (pred_10 ?v2 ?v5) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_10 obj_14 obj_01 obj_23 obj_11 obj_17 obj_21 obj_07 obj_18 obj_31 obj_12 obj_32 obj_03 obj_04 obj_06 obj_28 obj_02 obj_05 obj_24 obj_16 obj_09 obj_22 obj_08 obj_13 obj_26
    obj_25 obj_19 obj_20
    obj_27 obj_15 obj_30 obj_29
    )

    (:init
       (pred_11)

       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_17)
       (pred_4 obj_21)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_4 obj_31)
       (pred_4 obj_12)
       (pred_4 obj_32)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_06)
       (pred_4 obj_28)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_4 obj_24)
       (pred_4 obj_16)
       (pred_4 obj_09)
       (pred_4 obj_22)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_26)
       (pred_1 obj_25)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_9 obj_27)
       (pred_9 obj_15)
       (pred_9 obj_30)
       (pred_9 obj_29)

       (pred_6 obj_10 obj_17)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_01 obj_23)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_23 obj_18)
       (pred_6 obj_23 obj_11)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_11 obj_31)
       (pred_6 obj_11 obj_23)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_17 obj_21)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_21 obj_32)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_21 obj_17)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_31)
       (pred_6 obj_18 obj_23)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_31 obj_06)
       (pred_6 obj_31 obj_11)
       (pred_6 obj_31 obj_18)
       (pred_6 obj_12 obj_28)
       (pred_6 obj_12 obj_32)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_32 obj_02)
       (pred_6 obj_32 obj_03)
       (pred_6 obj_32 obj_21)
       (pred_6 obj_32 obj_12)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_32)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_31)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_28 obj_09)
       (pred_6 obj_28 obj_02)
       (pred_6 obj_28 obj_12)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_02 obj_32)
       (pred_6 obj_02 obj_28)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_24)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_24 obj_13)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_24 obj_05)
       (pred_6 obj_16 obj_26)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_09 obj_22)
       (pred_6 obj_09 obj_28)
       (pred_6 obj_22 obj_08)
       (pred_6 obj_22 obj_02)
       (pred_6 obj_22 obj_09)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_22)
       (pred_6 obj_13 obj_26)
       (pred_6 obj_13 obj_24)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_26 obj_16)
       (pred_6 obj_26 obj_13)
       (pred_7 obj_31)
       (pred_7 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_02)
       (pred_3  obj_31 obj_25)
       (pred_3  obj_04 obj_19)
       (pred_3  obj_08 obj_20)
       (pred_3  obj_02 obj_19)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_01)
       (pred_8 obj_23)
       (pred_8 obj_11)
       (pred_8 obj_17)
       (pred_8 obj_21)
       (pred_8 obj_07)
       (pred_8 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_32)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_28)
       (pred_8 obj_05)
       (pred_8 obj_24)
       (pred_8 obj_16)
       (pred_8 obj_09)
       (pred_8 obj_22)
       (pred_8 obj_13)
       (pred_8 obj_26)

       (pred_12  obj_27 obj_25)
       (pred_12  obj_15 obj_19)
       (pred_12  obj_30 obj_20)
       (pred_12  obj_29 obj_20)
       (pred_10 obj_27 obj_14)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_30 obj_10)
       (pred_10 obj_29 obj_24)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_10 obj_27 obj_24)
       (pred_10 obj_15 obj_26)
       (pred_10 obj_30 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_16)))
)
)

; plan
1. (op_1 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 0 of 3
2. (op_1 obj_14 obj_10)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_10)
   goals met: 0 of 3
3. (op_2 obj_10 obj_30)
   deleted: (pred_10 obj_30 obj_10) (pred_11)
   added: (pred_2 obj_30)
   goals met: 0 of 3
4. (op_1 obj_10 obj_14)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_14)
   goals met: 0 of 3
5. (op_1 obj_14 obj_01)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_01)
   goals met: 0 of 3
6. (op_1 obj_01 obj_07)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_07)
   goals met: 0 of 3
7. (op_5 obj_07 obj_30)
   deleted: (pred_2 obj_30)
   added: (pred_11) (pred_10 obj_30 obj_07)
   goals met: 1 of 3
8. (op_1 obj_07 obj_01)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_01)
   goals met: 1 of 3
9. (op_1 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 1 of 3
10. (op_2 obj_14 obj_27)
   deleted: (pred_10 obj_27 obj_14) (pred_11)
   added: (pred_2 obj_27)
   goals met: 1 of 3
11. (op_1 obj_14 obj_01)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_01)
   goals met: 1 of 3
12. (op_1 obj_01 obj_07)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_07)
   goals met: 1 of 3
13. (op_5 obj_07 obj_27)
   deleted: (pred_2 obj_27)
   added: (pred_11) (pred_10 obj_27 obj_07)
   goals met: 1 of 3
14. (op_1 obj_07 obj_01)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_01)
   goals met: 1 of 3
15. (op_2 obj_01 obj_15)
   deleted: (pred_10 obj_15 obj_01) (pred_11)
   added: (pred_2 obj_15)
   goals met: 1 of 3
16. (op_1 obj_01 obj_07)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_07)
   goals met: 1 of 3
17. (op_1 obj_07 obj_03)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_03)
   goals met: 1 of 3
18. (op_5 obj_03 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_11) (pred_10 obj_15 obj_03)
   goals met: 1 of 3
19. (op_1 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 1 of 3
20. (op_2 obj_07 obj_27)
   deleted: (pred_10 obj_27 obj_07) (pred_11)
   added: (pred_2 obj_27)
   goals met: 1 of 3
21. (op_1 obj_07 obj_03)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_03)
   goals met: 1 of 3
22. (op_1 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 1 of 3
23. (op_1 obj_05 obj_24)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_24)
   goals met: 1 of 3
24. (op_5 obj_24 obj_27)
   deleted: (pred_2 obj_27)
   added: (pred_11) (pred_10 obj_27 obj_24)
   goals met: 2 of 3
25. (op_1 obj_24 obj_05)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_05)
   goals met: 2 of 3
26. (op_1 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 2 of 3
27. (op_2 obj_03 obj_15)
   deleted: (pred_10 obj_15 obj_03) (pred_11)
   added: (pred_2 obj_15)
   goals met: 2 of 3
28. (op_1 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 2 of 3
29. (op_1 obj_05 obj_24)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_24)
   goals met: 2 of 3
30. (op_1 obj_24 obj_13)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_13)
   goals met: 2 of 3
31. (op_1 obj_13 obj_26)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_26)
   goals met: 2 of 3
32. (op_5 obj_26 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_11) (pred_10 obj_15 obj_26)
   goals met: 3 of 3
